Repository: AigizK/bashkort-parallel-corpora
Catalog: tmx/Эвклид3596.tmx
Source language: ru
Languages: ba

source: Это доказательство приводит в своей книге Шамсутдин ас-Самарканди, и ряд исследователей считали его автором самого ас-Самарканди
ba: Был иҫбатламаны үҙ китабында Шәмсуддин әс-Сәмәркәнди ҡуллана, шунлыҡтан тикшеренеүселәрҙең ҡайһы берҙәре уның авторы тип әс-Сәмәрҡәндиҙе һанай.

source: Доказательство исходит из верного в абсолютной геометрии утверждения о том, что для всякой прямой, пересекающей стороны данного угла, может быть построена ещё одна прямая, пересекающая стороны этого же угла и отстоящая от его вершины дальше, чем первая.
ba: Иҫбатлама абсолют геометрияла дөрөҫ булған раҫламанан сыға: бирелгән мөйөштөң яҡтарын киҫкән тура һыҙыҡ өсөн ошо уҡ мөйөштөң яҡтарын киҫеүсе һәм уның түбәһенән алыҫтараҡ ятыусы тағы бер тура һыҙыҡ үткәрергә мөмкин.

source: Но из этого утверждения автор делает логически необоснованный вывод о том, что через всякую точку внутри данного угла можно провести прямую, пересекающую обе стороны этого угла, — и основывает на этом последнем утверждении, эквивалентном V постулату, всё дальнейшее доказательство.
ba: Ләкин был раҫламанан автор логик яҡтан нигеҙләнмәгән һығымта яһай: бирелгән мөйөштөң эсендәге теләһә ҡайһы нөктә аша был мөйөштөң ике яғын да киҫә торған тура һыҙыҡ үткәреп була, ти һәм, V постулатҡа тиң һуңғы раҫламаһына нигеҙләнеп, артабанғы бөтә иҫбатлауын ҡора.

source: Насир ад-Дин ат-Туси предложил построение, аналогичное построению Омара Хайяма.
ba: Насыр әд-Дин ат-Туси Ғүмәр Хәйямдыҡы кеүек үк раҫлама тәҡдим итә.

source: Отметим, что сочинения ат-Туси стали известны Джону Валлису, и тем самым сыграли роль в развёртывании исследований по неевклидовой геометрии в Европе.
ba: Әйткәндәй, ат-Туси хеҙмәттәре Джон Валлисҡа билдәле була һәм шуның аша Европала Евклидтыҡы булмаған геометрия буйынса тикшеренеүҙәргә этәргес бирә.

source: Первую в Европе известную нам попытку доказательства аксиомы параллельности Евклида предложил живший в Провансе (Франция) Герсонид (он же Леви бен Гершом, XIV век).
ba: Европала Евклидтың параллеллек аксиомаһын иҫбатларға беҙгә билдәле булған тәүге ынтылышты Прованста (Франция) йәшәгән Герсонид (Леви бен Гершом да ул, XIV быуат) яһай.

source: Его доказательство опиралось на утверждение о существовании прямоугольника.
ba: Уның иҫбатламаһы тура дүртмөйөштөң барлығын раҫлауға таяна.

source: К XVI веку относится доказательство учёного-иезуита Христофора Клавиуса.
ba: Иезуит ғалим Христофор Клавиус раҫламаһы XVI быуатҡа ҡарай.

source: Доказательство его, как и у ибн Курры, основывалось на утверждении, что линия, равноотстоящая от прямой — тоже прямая.
ba: Уның иҫбатламаһы, ибн Курраныҡы кеүек үк, тура һыҙыҡтан тигеҙ алыҫлыҡтағы һыҙыҡтың да тура булыуына нигеҙләнә.

source: Джон Валлис в 1693 году в одной из своих работ воспроизводит перевод сочинения ат-Туси и предлагает эквивалентную, но более простую формулировку: существуют подобные, но не равные фигуры.
ba: Джон Валлис 1693 йылда хеҙмәттәренең береһендә ат-Туси хеҙмәтенең тәржемәһен килтерә һәм эквивалентлы, ләкин ябайыраҡ бирелеш тәҡдим итә: оҡшаш, ләкин тигеҙ булмаған фигуралар бар.

source: Клеро в своих «Началах геометрии» (1741), как и Герсонид, вместо V постулата взял его эквивалент «существует прямоугольник».
ba: Алекси Клод Клеро үҙенең «Геометрия башланғыстарында» (1741), Герсонид кеүек үк, V постулат урынына уның «тура дүртмөйөш бар» тигән эквивалентын ҡуллана.

source: В целом можно сказать, что все перечисленные попытки принесли немалую пользу: была установлена связь между V постулатом и другими утверждениями, были отчётливо сформулированы две альтернативы V постулату — гипотезы острого и тупого угла.
ba: Дөйөм алғанда был ынтылыштар тик файҙаға ғына була: V постулат менән башҡа раҫламалар араһында бәйләнеш асыҡлана, V постулатҡа ике альтернатива — ҡыҫынҡы һәм йәйенке мөйөш гипотезаһы — аныҡ итеп формалаштырыла.

source: Первые наброски неевклидовой геометрии
ba: Евклидтыҡы булмаған геометрияның тәүге һыҙмалары

source: Глубокое исследование V постулата, основанное на совершенно оригинальном принципе, провёл в 1733 году итальянский монах-иезуит, преподаватель математики Джироламо Саккери.
ba: V постулатты бөтөнләй өр-яңы күҙлектән тәрән итеп тикшереүҙе 1733 йылда итальян иезуит монахы математика уҡытыусыһы Джироламо Саккери атҡара.

source: Он опубликовал труд под названием «Евклид, очищенный от всех пятен, или же геометрическая попытка установить самые первые начала всей геометрии».
ba: Ул «Бөтә таптарҙан таҙартылған Евклид, йәғни бөтә геометрияның иң тәүге башланғыстарын геометрик юл менән ҡорорға тырышыу» тигән исемдәге хеҙмәтен баҫтыра.

source: Идея Саккери состояла в том, чтобы заменить V постулат противоположным утверждением, вывести из новой системы аксиом как можно больше следствий, тем самым построив «ложную геометрию», и найти в этой геометрии противоречия или заведомо неприемлемые положения.
ba: Саккери идеяһы V постулатты ҡапма-ҡаршы менән алмаштырыуҙан, аксиомаларҙың яңы системаһынан мөмкин тиклем күберәк эҙемтәләр сығарыуҙан, шуның менән «ялған геометрия» төҙөп, был геометрияла ҡапма-ҡаршылыҡтар йәки ҡулланып булмаҫтай положениелар табыуҙан тора.

source: Тогда справедливость V постулата будет доказана от противного.
ba: Ул сағында V постулаттың дөрөҫлөгө ҡапма-ҡаршынан сығып иҫбатлана.

source: Саккери рассматривает всё те же три гипотезы о 4-м угле четырёхугольника Ламберта.
ba: Саккери шул уҡ Ламберт дүртмөйөшөнөң 4-се мөйөшө тураһындағы өс гипотезаны ҡарай.

source: Гипотезу тупого угла он отверг сразу по формальным соображениям.
ba: Йәйенке мөйөш тураһындағы гипотезаны ул форма йәһәтенән шунда уҡ инҡар итә.

source: Легко показать, что в этом случае вообще все прямые пересекаются, а тогда можно заключить, что V постулат Евклида справедлив — ведь он как раз и утверждает, что при некоторых условиях прямые пересекаются.
ba: Был осраҡта бөтә тура һыҙыҡтар ҙа киҫешкәнен күрһәтеү ауыр түгел, ә ул сағында Евклидтың V постулаты дөрөҫ тигән һығымта яһала — ул ҡайһы бер шарттарҙа тура һыҙыҡтар киҫешә тип раҫлай ҙа инде.

source: Отсюда делается вывод, что «гипотеза тупого угла всегда целиком ложна, так как она сама себя разрушает».
ba: Тимәк, «йәйенке мөйөш гипотезаһы тулыһынса һәм һәр ваҡыт ялған, сөнки ул үҙен-үҙе емерә» тигән һығымта килеп сыға.

source: После этого Саккери переходит к опровержению «гипотезы острого угла», и здесь его исследование гораздо интереснее.
ba: Бынан һуң Саккери «ҡыҫынҡы мөйөш гипотезаһын» инҡар итергә тотона, бында инде уның тикшеренеүҙәре күпкә ҡыҙығыраҡ.

source: Он допускает, что она верна, и, одно за другим, доказывает целый ряд следствий.
ba: Ул уны дөрөҫ тип таба һәм бер-бер артлы бер нисә эҙемтәне иҫбатлай.

source: Сам того не подозревая, он продвигается довольно далеко в построении геометрии Лобачевского.
ba: Үҙе лә һиҙмәҫтән, ул Лобачевский геометрияһын төҙөү яғына йүнәлеш ала.

source: Многие теоремы, доказанные Саккери, выглядят интуитивно неприемлемыми, но он продолжает цепочку теорем.
ba: Саккери тарафынан иҫбат ителгән күп теоремалар интуиция кимәлендә ҡабул ителмәҫтәй тойолһа ла, ул теоремалар сылбырын дауам итә.

source: Наконец, Саккери доказывает, что в «ложной геометрии» любые две прямые или пересекаются, или имеют общий перпендикуляр, по обе стороны от которого они удаляются друг от друга, или же удаляются друг от друга с одной стороны и неограниченно сближаются с другой.
ba: Ниһайәт, Саккери «ялған геометрияла» теләһә ҡайһы ике тура һыҙыҡ йә киҫешә, йә уртаҡ перпендикулярға эйә була, улар йә был перпендикулярҙың ике яғында ла бер-береһенән алыҫлашалар, йә уның бер яғында бер-береһенән алыҫлашалар, ә икенсе яғында бер-береһенә сикһеҙ яҡынаялар, тип иҫбат итә.

source: В этом месте Саккери делает неожиданный вывод: «гипотеза острого угла совершенно ложна, так как противоречит природе прямой линии».
ba: Ошо урында Саккери көтөлмәгән һығымта яһай: «ҡыҫынҡы мөйөш гипотезаһы тулыһынса ялған, сөнки тура һыҙыҡтың холҡона бөтөнләй тап килмәй».

source: Видимо, Саккери чувствовал необоснованность этого «доказательства», потому что исследование продолжается. Он рассматривает эквидистанту — геометрическое место точек плоскости, равноотстоящих от прямой; в отличие от своих предшественников, Саккери понимает, что в рассматриваемом случае это вовсе не прямая.
ba: Күрәһең, Саккери был «иҫбатлауҙың» нигеҙһеҙлеген үҙе лә һиҙгәндер, сөнки тикшеренеүҙе дауам итә. Ул эквидистантаны — яҫылыҡта тура һыҙыҡтан бер иш алыҫлыҡта ятҡан нөктәләрҙең геометрик урынын — ҡарай; үҙ элгәрҙәренән айырмалы, Саккери был осраҡта бының тура һыҙыҡ түгеллеген аңлай.

source: Однако, вычисляя длину её дуги, Саккери допускает ошибку и приходит к реальному противоречию, после чего заканчивает исследование и с облегчением заявляет, что он «вырвал эту зловредную гипотезу с корнем».
ba: Ләкин, уның дуғаһының оҙонлоғон иҫәпләгәндә, Саккери хата ебәрә лә ҡаршылыҡҡа килеп төкәлә, артабан ул тикшеренеүҙе тамамлай һәм, еңел һулап, «был зарарлы гипотезаны тамырынан йолҡоп ташлауы» тураһында хәбәр итә.

source: К сожалению, пионерская работа Саккери, изданная посмертно, не обратила на себя того внимания математиков, которого заслуживала, и только спустя 150 лет (1889) его соотечественник Бельтрами обнаружил этот забытый труд и оценил его историческое значение.
ba: Ҡыҙғанысҡа ҡаршы, Саккери мәрхүм булғас баҫылып сыҡҡан был эш математиктарҙың тейешле иғтибарын тартмай һәм 150 йылдан ғына (1889) уның ватандашы Эудженио Бельтрами онотолған хеҙмәтте табып ала һәм уның тарихи әһәмиәтен баһалай.

source: Во второй половине XVIII века было опубликовано более 50 работ по теории параллельных. В обзоре тех лет (Г. С. Клюгель) исследуется более 30 попыток доказать V постулат и доказывается их ошибочность.
ba: XVIII быуаттың икенсе яртыһында парралель һыҙыҡтар теорияһы буйынса 50-ләгән хеҙмәт донъя күрә. Ул осорға яһалған күҙәтеүҙә (Георг Симон Клюгель) V постулатты иҫбат итергә ынтылыштарҙың 30-лаған осрағы ҡарала һәм уларҙың хаталы булыуы иҫбат ителә.

source: Известный немецкий математик и физик И. Г. Ламберт, с которым Клюгель переписывался, тоже заинтересовался проблемой; его «Теория параллельных линий» была издана (как и труд Саккери, посмертно) в 1786 году.
ba: Билдәле немец математигы һәм физигы Иоганн Генрих Ламберт та, Клюгель уның менән хатлашҡан, проблемаға ҡарата ҡыҙыҡһыныу күрһәтә; уның «Параллель һыҙыҡтар теорияһы» (Саккери хеҙмәте кеүек үк — мәрхүм булғас) 1786 йылда нәшер ителә.

source: Ламберт первым обнаружил, что «геометрия тупого угла» реализуется на сфере, если под прямыми понимать большие круги.
ba: Ламберт «йәйенке мөйөш геометрияһының» сферала ҙур түңәрәктәрҙе тура һыҙыҡтар тип аңлаған осраҡта тормошҡа ашыуын беренсе булып аса.

source: Он, как и Саккери, вывел из «гипотезы острого угла» множество следствий, причём продвинулся гораздо дальше Саккери; в частности, он обнаружил, что дополнение суммы углов треугольника до 180° пропорционально площади треугольника.
ba: Ул, Саккери кеүек үк, «ҡыҫынҡы мөйөш гипотезаһынан» бик күп эҙемтәләр сығара, хатта Саккериҙы байтаҡҡа уҙып китә; атап әйткәндә, ул өсмөйөш мөйөштәре суммаһының өҫтәмәһе өсмөйөш майҙанына пропорциональ икәнен таба.

source: В своей книге Ламберт проницательно отметил:
ba: Үҙенең китабында Ламберт шулай тип билдәләй:

source: Мне кажется очень замечательным, что вторая гипотеза [тупого угла] оправдывается, если вместо плоских треугольников взять сферические.
ba: Миңә шуныһы бик шәп тойола: яҫы өсмөйөштәр урынына сферик өсмөйөштәр алғанда икенсе [йәйенке мөйөш] гипотеза аҡлана.

source: Я из этого почти должен был бы сделать вывод — заключение, что третья гипотеза имеет место на какой-то мнимой сфере.
ba: Мин бынан шундай һығымта яһарға тейеш инем — өсөнсө гипотеза ниндәйҙер күҙалланған сферала эш итә.

source: Во всяком случае, должна же существовать причина, почему она на плоскости далеко не так легко поддаётся опровержению, как это могло быть сделано в отношении второй гипотезы.
ba: Һәр хәлдә, ни өсөн уның яҫылыҡта бик үк еңел инҡар ителмәүенең сәбәбе булырға тейеш тә баһа, ә икенсе гипотезаны инҡар итеп була бит

source: Ламберт не нашёл противоречия в гипотезе острого угла и пришёл к заключению, что все попытки доказать V постулат безнадёжны.
ba: Ламберт ҡыҫынҡы мөйөш гипотезаһында ҡапма-ҡаршылыҡ тапмай һәм, V постулатты иҫбат итеү мөмкин түгел, тигән һығымтаға килә.

source: Он не высказал каких-либо сомнений в ложности «геометрии острого угла», однако, судя по другому его проницательному замечанию, Ламберт размышлял о возможной физической реальности неевклидовой геометрии и о последствиях этого для науки:
ba: Ул «ҡыҫынҡы мөйөш геометрияһының» ялған булыуына бер шик тә белдермәй, ләкин, үткер иҫкәрмәһенә ҡарағанда, Ламберт Евклидтыҡы булмаған геометрияның ғәмәлләшеү ихтималлығы һәм бының фән өсөн ниндәй эҙемтәләре булыуы тураһында фекер йөрөткәндер:

source: В этом есть что-то восхитительное, что вызывает желание, чтобы третья гипотеза была справедлива.
ba: Бының һоҡланғыс яғы бар, хатта, өсөнсө гипотеза дөрөҫ булһын ине, тигән теләк тә тыуып ҡуя.

source: И всё же я хотел бы <...>, чтобы это было не так, потому что это было бы сопряжено с целым рядом <...> неудобств.
ba: Шуға ҡарамаҫтан <...>, улай була күрмәһен, тип теләйем, сөнки бының <...> уңайһыҙ яҡтары күп булыр ине.

source: Тригонометрические таблицы стали бы бесконечно пространными, подобие и пропорциональность фигур не существовали бы вовсе <...>, астрономии пришлось бы плохо.
ba: Тригонометрик таблицалар сикһеҙ киңәйеп китер ине, фигураларҙың оҡшашлығы һәм пропорционаллеге бөтөнләй булмаҫ ине <...>, астрономияның хәле хөртәйер ине.

source: Замечательная работа Ламберта, как и книга Саккери, далеко опередила своё время и не вызвала интереса у тогдашних математиков.
ba: Ламберттың бик әһәмиәтле хеҙмәте, Саккери китабы кеүек үк, ваҡытынан күпкә алда хасил була һәм ул заман математиктарында бер ҡыҙыҡһыныу ҙа тыуҙырмай.

source: Та же судьба постигла «астральную геометрию» немецких математиков Ф. К. Швейкарта (1817) и Ф. А. Тауринуса (1826), по идеям близкую к построенной Ламбертом.
ba: Немец математиктары Фердинанд Карл Швейкарт(1817) менән Франц Адольф Тауринус (1826) «астраль геометрияһы» ла шул уҡ яҙмышҡа тарый, уларҙың идеяһы ла Ламберттыҡына яҡын була.

source: Тем временем попытки «смыть пятна» с Евклида продолжались (Луи Бертран, Лежандр, Семён Гурьев и другие).
ba: Шул уҡ ваҡытта Евклидтың «таптарын йыуырға» ынтылыштар дауам итә (Луи Бертран, Адриен Мари Лежандр, Семён Емельянович Гурьев һәм башҡалар).

source: Лежандр дал целых три доказательства V постулата, ошибочность которых быстро показали его современники.
ba: Лежандр V постулатҡа өс иҫбатлама бирә, ләкин уларҙың хаталы булыуын замандаштары бик тиҙ дәлилләй.

source: Последнее «доказательство» он опубликовал в 1823 году, за три года до первого доклада Лобачевского о новой геометрии.
ba: Һуңғы «иҫбатламаһын» ул 1823 йылда, Лобачевскийҙың яңы геометрия тураһындағы докладына тиклем өс йыл элек, нәшер итә.

source: Открытие неевклидовой геометрии
ba: Евклидтыҡы булмаған геометрияны асыу

source: В первой половине XIX века по пути, проложенному Саккери, пошли К. Ф. Гаусс, Я. Бойяи, Н. И. Лобачевский и Ф. К. Швайкарт.
ba: XIX быуаттың беренсе яртыһында Саккери һалған һуҡмаҡтан Карл Фридрих Гаусс, Янош Бойяи, Н. И. Лобачевский һәм Фердинанд Карл Швейкарт юллана.

source: Но цель у них была уже иная — не разоблачить неевклидову геометрию как невозможную, а, наоборот, построить альтернативную геометрию и выяснить её возможную роль в реальном мире.
ba: Ләкин уларҙың маҡсаты башҡа — Евклидтыҡы булмаған геометрияны мөмкин булмаҫтай нәмә итеп фашлау түгел, ә, киреһенсә, альтернатив геометрия төҙөү һәм реаль донъяла уның ихтимал булған ролен асыҡлау.

source: На тот момент это была совершенно еретическая идея; никто из учёных ранее не сомневался, что физическое пространство евклидово.
ba: Заманы өсөн әҙәм ышанмаҫ идея була; быға тиклем бер ғалим да физик арауыҡтың Евклидтыҡы икәнлегендә шикләнмәй.

source: Интересно, что Гаусса и Лобачевского учил в молодости один и тот же учитель — Мартин Бартельс, который, впрочем, сам неевклидовой геометрией не занимался.
ba: Шуныһы ҡыҙыҡ: Гауссты ла, Лобачевскийҙы ла йәш саҡтарында бер үк уҡытыусы — Мартин Фёдорович Бартельс уҡыта, ләкин ул үҙе Евклидтыҡы булмаған геометрия менән шөғөлләнмәй.

source: Первым был Швайкарт. В 1818 году он отправил Гауссу письмо с серьёзным анализом основ неевклидовой геометрии, однако воздержался от вынесения своих взглядов на публичное обсуждение.
ba: Швайкарт беренсе була. 1818 йылда ул Гауссҡа, Евклидтыҡы булмаған геометрия нигеҙҙәрен етди анализлап, хат яҙып ебәрә, ләкин ҡарашын асыҡ фекер алышыуға сығарыуҙан тартына.

source: Гаусс тоже не решился опубликовать работу на эту тему, но его черновые заметки и несколько писем однозначно подтверждают глубокое понимание неевклидовой геометрии.
ba: Гаусс та был темаға яҙылған хеҙмәтте баҫтырырға баҙнат итмәй, ләкин уның ҡараламалағы яҙмалары һәм бер нисә хаты Евклидтыҡы булмаған геометрияны тәрән аңлауын раҫлай.

source: Вот несколько характерных отрывков из писем Гаусса, где впервые в науке появляется термин «неевклидова геометрия»:
ba: Бына Гаусстың хаттарынан өҙөмтәләр, «Евклидтыҡы булмаған геометрия» тигән термин фәндә беренсе булып унда барлыҡҡа килә:

source: Допущение, что сумма трёх углов треугольника меньше 180°, приводит к своеобразной, совершенно отличной от нашей [евклидовой] геометрии; эта геометрия совершенно последовательна, и я развил её для себя совершенно удовлетворительно; я имею возможность решить в этой геометрии любую задачу, за исключением определения некоторой постоянной, значение которой a priori установлено быть не может.
ba: Өсмөйөштөң өс мөйөшөнөң суммаһын 180°-тан кәм тип ҡарау бөтөнләй башҡа, беҙҙекенән [Евклидтыҡынан] айырылып торған геометрияға килтерә; был геометрияға эҙмә-эҙлелек хас, мин уны үҙем өсөн ҡәнәғәтләнерлек итеп үҫтерҙем; мин был геометрияла теләһә ниндәй мәсьәләне сисә алам, бер даими һан билдәләмәһенән башҡаһын, уның ҡиммәте a priori билдәләнә алмай.

source: Чем большее значение мы придадим этой постоянной, тем ближе мы подойдем к евклидовой геометрии, а бесконечно большое её значение приводит обе системы к совпадению.
ba: Был даими һанға ни тиклем ҙурыраҡ әһәмиәт бирһәк, Евклид геометрияһына шул тиклем яҡыныраҡ килербеҙ, ә уның сикһеҙ ҙур ҡиммәте ике системаның да тап килеүенә килтерә.

source: Предложения этой геометрии отчасти кажутся парадоксальными и непривычному человеку даже несуразными; но при строгом и спокойном размышлении оказывается, что они не содержат ничего невозможного.
ba: Был геометрияның тәҡдимдәре парадоксаль булып күренә һәм күнекмәгән кешегә хатта мәғәнәһеҙ кееүк тойола; ләкин тыныс һәм теүәл фекер йөрөтһәң, уларҙа мөмкин булмаған бер ни ҙә юҡ икәне асыҡлана.

source: Так, например, все три угла треугольника можно сделать сколь угодно малыми, если только взять достаточно большие стороны; площадь же треугольника не может превысить, даже не может достичь некоторого предела, как бы велики ни были его стороны.
ba: Мәҫәлән, өсмөйөштөң яҡтарын ҙурыраҡ итеп алғанда өс мөйөшөн дә бик бәләкәй итергә була;ләкин уның яҡтары ни тиклем ҙур булһа ла, майҙаны ниндәйҙер сиктән үтә лә, хатта уға етә лә алмай.

source: Все мои старания найти в этой неевклидовой геометрии противоречие или непоследовательность остались бесплодными, и единственное, что в этой системе противится нашему разуму, это то, что в пространстве, если бы эта система была справедлива, должна была бы существовать некоторая сама по себе определенная (хотя нам и неизвестная) линейная величина.
ba: Был Евклидтыҡы булмаған геометрияла ҡапма-ҡаршылыҡ йә тап килмәүсәнлек табырға күпме генә тырышһам да, уңышҡа өлгәшә алманым, тик был системаның беҙҙең аҡылға ятышһыҙ тойолған берҙән-бер яғы бар: әгәр был система ғәҙел булһа, арауыҡта бер аныҡ (хатта беҙгә билдәле булмаһа ла) һыҙыҡлы дәүмәл булырға тейеш.

source: Но мне кажется, что мы, кроме ничего не выражающей словесной мудрости метафизиков, знаем очень мало или даже не знаем ничего о сущности пространства.
ba: Ләкин беҙ, метафизиктарҙың бер ни аңлатмаған аҡыллы һүҙенән башҡа, арауыҡтың асылы тураһында бик әҙ беләбеҙ, хатта бер ни ҙә белмәйбеҙ, тип уйлайым.

source: (Из письма к Тауринусу, 1824)
ba: (Франц Адольф Тауринусҡа хатынан, 1824)

source: В 1818 году в письме к австрийскому астроному Герлингу Гаусс выразил свои опасения:
ba: 1818 йылда Австрия астрономы Герлингҡа яҙған хатында Гаусс шөбһәләрен белдерә:

source: Я радуюсь, что вы имеете мужество высказаться так, как если бы Вы признавали ложность нашей теории параллельных, а вместе с тем и всей нашей геометрии.
ba: Һеҙҙең, парраллель һыҙыҡтар тураһындағы теориябыҙҙы, уның менән бергә бөтә геометриябыҙҙы ла ялған тигән кеүегерәк хәбәр һөйләргә батырсылыҡ итеүегеҙ өсөн шатмын.

source: Но осы, гнездо которых Вы потревожите, полетят Вам на голову.
ba: Ләкин Һеҙ тынысһыҙлаған һағыҙаҡтар Һеҙҙең үк башығыҙға осоп ҡунасаҡ бит.

source: Ознакомившись с работой Лобачевского «Геометрические исследования по теории параллельных», Гаусс энергично ходатайствует об избрании русского математика иностранным членом-корреспондентом Гёттингенского королевского общества (что и произошло в 1842 году).
ba: Лобачевскийҙың «Параллель һыҙыҡтар теорияһы буйынса геометрик тикшеренеүҙәр» тигән хеҙмәте менән танышҡас, Гаусс бик әүҙем рәүештә урыҫ математигын Гёттинген король йәмғиәтенең сит ил мөхбир ағзаһы итеп һайлауҙы юллай башлай (1842 йылда был ғәмәлгә аша).

source: Лобачевский и Бойяи проявили бо́льшую смелость, чем Гаусс, и почти одновременно (Лобачевский — в докладе 1826 года и публикации 1829 года; Бойяи — в письме 1831 года и публикации 1832 года), независимо друг от друга, опубликовали изложение того, что сейчас называется геометрией Лобачевского.
ba: Лобачевский һәм Бойяи Гауссҡа ҡарағанда ҙурыраҡ ҡыйыулыҡ күрһәтә һәм икеһе бер юлы (Лобачевский — 1826 йылда докладында һәм 1829 йылда баҫма хеҙмәтендә; Бойяи — 1831 йылғы хатында һәм 1832 йылғы баҫма хеҙмәтендә), бер-береһенә бәйһеҙ рәүештә, хәҙерге ваҡытта Лобачевский геометрияһы тип аталған ғилемде һүрәтләй.

source: Лобачевский продвинулся в исследовании новой геометрии дальше всех, и она в настоящий момент носит его имя.
ba: Лобачевский яңы геометрияны эшләүҙә бөтәһенән дә алғараҡ китә, һәм ул хәҙер уның исемен йөрөтә.

source: Но главная его заслуга не в этом, а в том, что он поверил в новую геометрию и имел мужество отстаивать своё убеждение (он даже предложил экспериментально проверить V постулат, измерив сумму углов треугольника).
ba: Ләкин уның төп ҡаҙанышы унда түгел, ә яңы геометрияға ышаныуында һәм ҡарашын ҡыйыу яҡлауында (ул хатта өсмөйөштөң мөйөштәрен үлсәү юлы менән V постулатты экспериментта тикшереп ҡарарға тәҡдим итә) .

source: Во вступлении к своей книге «Новые начала геометрии» Лобачевский решительно заявляет:
ba: «Геометрияның яңы башланғыстары» тигән китабының инешендә Лобачевский былай тип белдерә:

source: Всем известно, что в геометрии теория параллельных до сих пор оставалась несовершенной.
ba: Бөтәһенә лә билдәле булыуынса, геометрияла параллель һыҙыҡтар теорияһы ошоғаса камил түгел ине.

source: Напрасное старание со времён Евклида, в продолжении двух тысяч лет, заставили меня подозревать, что в самых понятиях ещё не заключается той истины, которую хотели доказывать и которую проверить, подобно другим физическим законам, могут лишь опыты, каковы, например, астрономические наблюдения.<...> Главное заключение <...> допускает существование геометрии в более обширном смысле, нежели как её представил нам первый Евклид.
ba: Евклид заманынан уҡ, ике мең йыл буйы бушҡа мәшәҡәтләнеү миндә шик тыуҙырҙы, иҫбат итергә теләгән хәҡиҡәт төшөнсәләрҙә ятмай шул, уны, башҡа физик ҡанундар кеүек үк, тик тәжрибәләр генә, мәҫәлән, астономик күҙәтеүҙәр, тикшерә ала.<...>Төп һығымта <...> беренсе Евклид беҙгә тәҡдим иткәндән күпкә киңерәк мәғәнәлә геометрия булыуын аңғарта.
